LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/PT035HV_screen.c
/*******************************************************************************
*   Ledger Blue - Non secure firmware
*   (c) 2016 Ledger
*
*  Licensed under the Apache License, Version 2.0 (the "License");
*  you may not use this file except in compliance with the License.
*  You may obtain a copy of the License at
*
*      http://www.apache.org/licenses/LICENSE-2.0
*
*   Unless required by applicable law or agreed to in writing, software
*   distributed under the License is distributed on an "AS IS" BASIS,
*   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
*   See the License for the specific language governing permissions and
*   limitations under the License.
********************************************************************************/

#include "stm32l4xx_hal.h"
#include "stm32l4xx_hal_gpio.h"
#include "stm32l4xx_hal_spi.h"
#include "stm32l4xx_hal_tim.h"

// for varargs support in printf
#include <stdarg.h>
#include <string.h>

#ifdef HAVE_PT035HV
//#define HAVE_PT035HV_ROTATION_0
//#define HAVE_PT035HV_ROTATION_180

#include "bagl.h"

#include "seproxyhal.h"


// invert to display on a negative polarized screen
//#define HAVE_64128M_BLACK_ON_WHITE


/**
 * N lines of M chars on font 6x8
 * [{line0}{line1}...{line7}]
 */

/*
char screen_char_buffer[SCREEN_LINE_COUNT*SCREEN_LINE_CHAR_COUNT];
*/

extern SPI_HandleTypeDef hspi;

#define SCREEN_HEIGHT 480
#define SCREEN_WIDTH 320
#define PRINTF_ZONE_HEIGHT (56+1)
#define PRINTF_FONT_HEIGHT 8
#define PRINTF_FONT_WIDTH 5
#define PRINTF_FONT_ID BAGL_FONT_LUCIDA_CONSOLE_8
#define PRINTF_LINE_CHAR_LENGTH (SCREEN_WIDTH/PRINTF_FONT_WIDTH)
#define PRINTF_LINE_COUNT (PRINTF_ZONE_HEIGHT/PRINTF_FONT_HEIGHT)
unsigned char screen_charbuffer[PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT];


#define DISP_NRST(x) BB_OUT(GPIOC, 1,x)
#define DISP_NCS(x) BB_OUT(GPIOB, 14,x)
#define TS_CE(x) BB_OUT(GPIOC, 10, x)




void spi2_change_clock(unsigned int mhz) {
  RCC_OscInitTypeDef RCC_OscInitStruct;
  
  memset(&hspi, 0, sizeof(hspi));
  memset(&RCC_OscInitStruct, 0, sizeof(RCC_OscInitStruct));
  
  DISP_NCS(1);
  
  /*
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 1; // 1 to 8
  RCC_OscInitStruct.PLL.PLLN = mhz; // 8 to 86 // equals MBit of SPI1 for screen
  //RCC_OscInitStruct.PLL.PLLN = 32; // 8 to 86 // equals MBit of SPI1 for screen
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7; // SAI1/SAI2
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2; // 48M1CLK
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV4; // SYSCLK
  HAL_RCC_OscConfig(&RCC_OscInitStruct);
  */

  SPI2->CR1 &= ~SPI_CR1_SPE;  
  hspi.Instance = SPI2;
  hspi.Init.Mode = SPI_MODE_MASTER;
  hspi.Init.Direction = SPI_DIRECTION_2LINES;
  hspi.Init.DataSize = SPI_DATASIZE_9BIT;
  hspi.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi.Init.NSS = SPI_NSS_SOFT;
  // OK // hspi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_4;
  hspi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
/*
#ifdef LOW_SPEED_SCREEN
  hspi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_8;
#endif // LOW_SPEED_SCREEN
*/
  hspi.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi.Init.TIMode = SPI_TIMODE_DISABLED;
  hspi.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLED;
  hspi.Init.CRCPolynomial = 10;
  hspi.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  hspi.Init.NSSPMode = SPI_NSS_PULSE_ENABLED;
  HAL_SPI_Init(&hspi);
  /* Enable SPI peripheral */
  SPI2->CR1 |=  SPI_CR1_SPE;  
}

#define MSG2133_I2C_ADDR 0x4C
I2C_HandleTypeDef hi2c;

#define FLAG_COMMAND 1
#define FLAG_PARAM 2
#define FLAG_READ 4
//#define FLAG_WRITE 8
#define FLAG_DUMMY 16
#define FLAG_FLUSH 32

unsigned char lcd_data(unsigned int flags, unsigned char d) {
  
  unsigned int tmp;
  if (flags&FLAG_PARAM) {
    tmp = 0x100 | d;
  }
  else {
    tmp = d;
  }

  SPI2->DR = tmp; // write data to be transmitted to the SPI data register
  
  while( !(SPI2->SR & SPI_SR_TXE) ); // wait until transmit complete

  return 0;
}

//--------------------------------------------------------------------------//
// HX8357 Driver Registers
//--------------------------------------------------------------------------//
#define HX8357_NOP                        0x00
#define HX8357_EXIT_SLEEP_MODE            0x11
#define HX8357_NORON                      0x13
#define HX8357_SET_DISPLAY_OFF            0x28
#define HX8357_SET_DISPLAY_ON             0x29
#define HX8357_SET_COLUMN_ADDRESS         0x2A
#define HX8357_SET_PAGE_ADDRESS           0x2B
#define HX8357_WRITE_MEMORY_START         0x2C
#define HX8357_READ_MEMORY_START          0x2E
#define HX8357_SET_TEAR_OFF               0x34
#define HX8357_SET_TEAR_ON                0x35
#define HX8357_SET_ADDRESS_MODE           0x36
#define HX8357_SET_PIXEL_FORMAT           0x3A
#define HX8357_WRITE_MEMORY_CONTINUE      0x3C
#define HX8357_READ_MEMORY_CONTINUE       0x3E
#define HX8357_SET_INTERNAL_OSCILLATOR    0xB0
#define HX8357_SET_POWER_CONTROL          0xB1
#define HX8357_SET_DISPLAY_MODE           0xB4
#define HX8357_SET_BGP                    0xB5
#define HX8357_SET_VCOM_VOLTAGE           0xB6
#define HX8357_ENABLE_EXTENSION_COMMAND   0xB9
#define HX8357_SET_PANEL_DRIVING          0xC0    // not documented!
#define HX8357_SET_PANEL_CHARACTERISTIC   0xCC
#define HX8357_SET_GAMMA_CURVE            0xE0

#define HX8357_ALLON            0x23
#define HX8357_ALLOFF           0x22
#define HX8357_INVON            0x21
#define HX8357_INVOFF           0x20
#define HX8357_DISPLAYOFF         0x28
#define HX8357_DISPLAYON          0x29

void screen_set_xy(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) 
{
 lcd_data(FLAG_COMMAND, HX8357_SET_COLUMN_ADDRESS); // Column addr set
 #define colstart 0
 lcd_data(FLAG_PARAM, (x0+colstart) >> 8);
 lcd_data(FLAG_PARAM, x0+colstart);     // XSTART 
 lcd_data(FLAG_PARAM, (x1+colstart) >> 8);
 lcd_data(FLAG_PARAM, x1+colstart);     // XEND

