LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/PT035HV_screen.c
 lcd_data(FLAG_COMMAND, HX8357_SET_PAGE_ADDRESS); // Row addr set
 #define rowstart 0
 lcd_data(FLAG_PARAM, (y0+rowstart) >> 8);
 lcd_data(FLAG_PARAM, y0+rowstart);     // YSTART
 lcd_data(FLAG_PARAM, (y1+rowstart) >> 8);
 lcd_data(FLAG_PARAM, y1+rowstart);     // YEND

}


void screen_poweroff(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  
  // TODO low power the screen and touchscreen

}

/**
  *
  *
  */
void EXTI15_10_IRQHandler(void) {
  // then it's the touch screen that interrupted
  // read the touch screen position data
  unsigned char buffer[32];
  HAL_I2C_Master_Receive(&hi2c, MSG2133_I2C_ADDR, buffer, 8, 1024);  // no timeout

  /*
  // light on upon touch
  UI_led_power(1);
  */

  if (buffer[0] == 0x52) {
    switch(buffer[1]) {
      case 0xFF:
        // releasing !!
        // only one release event to lower the cpu load
        if (G_io_touch.ts_last_x >= 0 && G_io_touch.ts_last_y >= 0) {
          __asm("cpsid i");
          G_io_seproxyhal_events |= SEPROXYHAL_EVENT_RELEASE;
          __asm("cpsie i");
        }
        break;
      default: {
        uint16_t x1, y1;
        x1 = ((buffer[1] & 0xF0) << 4) | buffer[2];
        y1 = ((buffer[1] & 0x0F) << 8) | buffer[3];
        
        //#ifdef YL035_2_FINGERS
        int16_t x2, y2;
        x2 = ((buffer[4] & 0xF0) << 4) | buffer[5];
        if (x2 & 0x800) {
          x2 |= 0xF000;
        }
        y2 = ((buffer[4] & 0x0F) << 8) | buffer[6];
        if (y2 & 0x800) {
          y2 |= 0xF000;
        }
        //x2 = x2 *15 / 64;//480/2048;
        //y2 = y2 * 5 / 32;//320/2048;
        //#endif // YL035_2_FINGERS

        G_io_touch.ts_last_2 = 0;
        if (x2 || y2) {
          x2 += x1;
          y2 += y1;

          x2 = x2 *15 / 64;//480/2048;
          y2 = y2 * 5 / 32;//320/2048;

          // a second finger is available
          G_io_touch.ts_last_2 = 1;
        }

        // adjust the second finger with the offset of the first
        x1 = x1 *15 / 64;//480/2048;
        y1 = y1 * 5 / 32;//320/2048;
        
        // reverse the y coord
#ifdef HAVE_PT035HV_ROTATION_0
        G_io_touch.ts_last_x = SCREEN_WIDTH-y1;
        G_io_touch.ts_last_y = x1;
        G_io_touch.ts_last_x2 = SCREEN_WIDTH-y2;
        G_io_touch.ts_last_y2 = x2;
#endif // HAVE_PT035HV_ROTATION_0
#ifdef HAVE_PT035HV_ROTATION_180
        G_io_touch.ts_last_x = y1;
        G_io_touch.ts_last_y = SCREEN_HEIGHT-x1;
        G_io_touch.ts_last_x2 = y2;
        G_io_touch.ts_last_y2 = SCREEN_HEIGHT-x2;
#endif // HAVE_PT035HV_ROTATION_180

        __asm("cpsid i");
        G_io_seproxyhal_events |= SEPROXYHAL_EVENT_TOUCH;
        __asm("cpsie i");
      }
    }
  }    
  __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_11);
}

// manually pump the touch events to avoid problems of the USART/I2C conflicts
void screen_update_touch_event(void) {
  if (__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_11)) {
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_11);
    EXTI15_10_IRQHandler();
  }

  if ((G_io_seproxyhal_events & (SEPROXYHAL_EVENT_TOUCH|SEPROXYHAL_EVENT_RELEASE)) == 0 
    && G_io_touch.ts_last_2) {
    G_io_touch.ts_last_2 = 0;
    G_io_touch.ts_last_x = G_io_touch.ts_last_x2;
    G_io_touch.ts_last_y = G_io_touch.ts_last_y2;
    G_io_seproxyhal_events |= SEPROXYHAL_EVENT_TOUCH;
  }
}

unsigned int current_x;
unsigned int newline_requested;
void screen_init(unsigned char reinit)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  G_io_touch.ts_last_x = -1;
  G_io_touch.ts_last_y = -1;

  current_x = 0;
  newline_requested = 0;
  memset(((char*)screen_charbuffer),' ',sizeof(screen_charbuffer));

  /* PC10 TS_CE */
  GPIO_InitStruct.Pin = GPIO_PIN_10;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /* PC11 TS_IRQ */
  GPIO_InitStruct.Pin = GPIO_PIN_11;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /**I2C1 GPIO Configuration    
  PB8     ------> I2C1_SCL
  PB9     ------> I2C1_SDA 
  */
  GPIO_InitStruct.Pin = GPIO_PIN_8|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* Peripheral clock enable */
  __I2C1_CLK_ENABLE();

  memset(&hi2c, 0, sizeof(hi2c));

  hi2c.Instance = I2C1;
  hi2c.Init.Timing = 0x10909CEC; // 100khz @ 80mhz
  hi2c.Init.Timing = 0x00702991; // 400khz @ 80mhz
  hi2c.Init.OwnAddress1 = 0;
  hi2c.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c.Init.DualAddressMode = I2C_DUALADDRESS_DISABLED;
  hi2c.Init.OwnAddress2 = 0;
  hi2c.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
  hi2c.Init.NoStretchMode = I2C_NOSTRETCH_DISABLED;
  HAL_I2C_Init(&hi2c);
  HAL_I2CEx_AnalogFilter_Config(&hi2c, I2C_ANALOGFILTER_ENABLED);

  // reset Touch screen
  TS_CE(0);

  if (!reinit) {
    // reset the display and clear it
    // setup touchscreen
    /* GPIO Ports Clock Enable */
    __GPIOB_CLK_ENABLE();
    __GPIOC_CLK_ENABLE();

    /* Peripheral clock enable */
    __SPI2_CLK_ENABLE();

    /**SPI2 GPIO Configuration    
    PB13     ------> SPI1_SCK
    PB15     ------> SPI1_MOSI 
    */
    GPIO_InitStruct.Pin = GPIO_PIN_13|GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* PB14 DISP_CS */
    GPIO_InitStruct.Pin = GPIO_PIN_14;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    DISP_NCS(1);

    /* PC1 DISP_RESET (NRST) */
    GPIO_InitStruct.Pin = GPIO_PIN_1;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    DISP_NRST(0);

