LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/PT035HV_screen.c
    //spi2_change_clock(16);
	
  SPI2->CR1 &= ~SPI_CR1_SPE;  
  hspi.Instance = SPI2;
  hspi.Init.Mode = SPI_MODE_MASTER;
  hspi.Init.Direction = SPI_DIRECTION_2LINES;
  hspi.Init.DataSize = SPI_DATASIZE_9BIT;
  hspi.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi.Init.NSS = SPI_NSS_SOFT;
  // OK // hspi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_4;
  hspi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;

#ifdef LOW_SPEED_SCREEN
  hspi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_8;
#endif // LOW_SPEED_SCREEN

  hspi.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi.Init.TIMode = SPI_TIMODE_DISABLED;
  hspi.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLED;
  hspi.Init.CRCPolynomial = 10;
  hspi.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  hspi.Init.NSSPMode = SPI_NSS_PULSE_ENABLED;
  HAL_SPI_Init(&hspi);
  /* Enable SPI peripheral */
  SPI2->CR1 |=  SPI_CR1_SPE; 

    // reset the screen
    DISP_NRST(1);  
    /* Enable the interrupt service thread/routine for INT after 50ms */
    HAL_Delay(60);


    // first, force a hardware reset

    // assert delay before starting requests
    // 1000 = 6ms @ msirange 5
    // 166 = 1ms @ msirange 5
    // 333 = 1ms @ msirange 6 @4mhz
    // 20000 = 120ms @ msirange 5
    //for (volatile int i = 0; i < 1000; i++);

    DISP_NCS(0);
    lcd_data(FLAG_COMMAND|FLAG_FLUSH, HX8357_EXIT_SLEEP_MODE); //Sleep Out
    HAL_Delay(200);

    lcd_data(FLAG_COMMAND, HX8357_ENABLE_EXTENSION_COMMAND);
    lcd_data(FLAG_PARAM, 0xFF);
    lcd_data(FLAG_PARAM, 0x83);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x57);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_POWER_CONTROL);
    lcd_data(FLAG_PARAM, 0x00);
    lcd_data(FLAG_PARAM, 0x12);
    lcd_data(FLAG_PARAM, 0x12);
    lcd_data(FLAG_PARAM, 0x12);
    lcd_data(FLAG_PARAM, 0xC3);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x44);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_DISPLAY_MODE);
    lcd_data(FLAG_PARAM, 0x02);
    lcd_data(FLAG_PARAM, 0x40);
    lcd_data(FLAG_PARAM, 0x00);
    lcd_data(FLAG_PARAM, 0x2A);
    lcd_data(FLAG_PARAM, 0x2A);
    lcd_data(FLAG_PARAM, 0x20);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x91);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_VCOM_VOLTAGE);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x38);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_INTERNAL_OSCILLATOR);
    lcd_data(FLAG_PARAM, 0x68);
    lcd_data(FLAG_COMMAND, 0xE3); //Unknown Command
    lcd_data(FLAG_PARAM, 0x2F);
    lcd_data(FLAG_PARAM, 0x1F);
    lcd_data(FLAG_COMMAND, HX8357_SET_BGP); //Set BGP
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x67);
    lcd_data(FLAG_COMMAND, HX8357_SET_PANEL_DRIVING);
    lcd_data(FLAG_PARAM, 0x70);
    lcd_data(FLAG_PARAM, 0x70);
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x3C);
    lcd_data(FLAG_PARAM, 0xC8);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x08);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, 0xC2); // Set Gate EQ
    lcd_data(FLAG_PARAM, 0x00);
    lcd_data(FLAG_PARAM, 0x08);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x04);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_PANEL_CHARACTERISTIC);
  #ifdef HAVE_PT035HV_ROTATION_0  
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x09); // proto screen direction
  #endif
  #ifdef HAVE_PT035HV_ROTATION_180
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x05); // final screen direction (usb reversed)
  #endif 
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_GAMMA_CURVE);
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x02);
    lcd_data(FLAG_PARAM, 0x03);
    lcd_data(FLAG_PARAM, 0x05);
    lcd_data(FLAG_PARAM, 0x0E);
    lcd_data(FLAG_PARAM, 0x22);
    lcd_data(FLAG_PARAM, 0x32);
    lcd_data(FLAG_PARAM, 0x3B);
    lcd_data(FLAG_PARAM, 0x5C);
    lcd_data(FLAG_PARAM, 0x54);
    lcd_data(FLAG_PARAM, 0x4C);
    lcd_data(FLAG_PARAM, 0x41);
    lcd_data(FLAG_PARAM, 0x3D);
    lcd_data(FLAG_PARAM, 0x37);
    lcd_data(FLAG_PARAM, 0x31);
    lcd_data(FLAG_PARAM, 0x21);
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x02);
    lcd_data(FLAG_PARAM, 0x03);
    lcd_data(FLAG_PARAM, 0x05);
    lcd_data(FLAG_PARAM, 0x0E);
    lcd_data(FLAG_PARAM, 0x22);
    lcd_data(FLAG_PARAM, 0x32);
    lcd_data(FLAG_PARAM, 0x3B);
    lcd_data(FLAG_PARAM, 0x5C);
    lcd_data(FLAG_PARAM, 0x54);
    lcd_data(FLAG_PARAM, 0x4C);
    lcd_data(FLAG_PARAM, 0x41);
    lcd_data(FLAG_PARAM, 0x3D);
    lcd_data(FLAG_PARAM, 0x37);
    lcd_data(FLAG_PARAM, 0x31);
    lcd_data(FLAG_PARAM, 0x21);
    lcd_data(FLAG_PARAM, 0x00);
    lcd_data(FLAG_PARAM, 0x01);
    HAL_Delay(10);
    
    lcd_data(FLAG_COMMAND, HX8357_SET_PIXEL_FORMAT); //COLMOD RGB565
    lcd_data(FLAG_PARAM, 0x55);
    
    lcd_data(FLAG_COMMAND, HX8357_SET_ADDRESS_MODE);
    lcd_data(FLAG_PARAM, 0x00);
    /*
    lcd_data(FLAG_COMMAND, HX8357_SET_TEAR_ON); //TE ON
    lcd_data(FLAG_PARAM, 0x00);
    */

    lcd_data(FLAG_COMMAND, HX8357_SET_INTERNAL_OSCILLATOR);
    //lcd_data(FLAG_PARAM, 0x66); // 60Hz
    lcd_data(FLAG_PARAM, 0x99); // 75Hz
    //lcd_data(FLAG_PARAM, 0xCC); // 90Hz
    lcd_data(FLAG_PARAM, 0x01); // OSC_EN

    // until screen_on is called
    lcd_data(FLAG_COMMAND, HX8357_ALLOFF);
    //

    lcd_data(FLAG_COMMAND|FLAG_FLUSH, HX8357_SET_DISPLAY_ON); //Display On
    HAL_Delay(10);

    /*
    for(;;) {
      lcd_data(FLAG_COMMAND, HX8357_ALLON);
      HAL_Delay(1000);
      lcd_data(FLAG_COMMAND, HX8357_ALLOFF);
      HAL_Delay(1000);
    }
    */
    
    /*


    // to be remove after debug when SDO is connected
    lcd_data(FLAG_COMMAND|FLAG_FLUSH, HX8357_NORON);
    screen_brightness(70);


    //bagl_draw_bg(0xF9F9F9);

    unsigned int spi_clock = 34;
    do {
      spi_clock-=2;
      spi2_change_clock(spi_clock);

      // paint all
      bagl_draw_bg(0xAAAAAA);

      // reread data to ensure everything is fine, else lower speed and redo it
      if (screen_ensure_data(0xAAAAAA, 0, 0, 320, 480)) {
        break;
      }
    }
    while(spi_clock > 16);
    */

    bagl_draw_bg(0xF9F9F9);

