LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/PT035HV_screen.c
    //spi2_change_clock(28);

  }
  else {
    HAL_Delay(200);
  }

  // finish reset of the touch panel
  TS_CE(1);
  HAL_Delay(10);
  TS_CE(0);
  HAL_Delay(10);
  TS_CE(1);

  // consume touch interrupt
  NVIC_ClearPendingIRQ(EXTI15_10_IRQn);
}

void screen_on(void) {
  lcd_data(FLAG_COMMAND|FLAG_FLUSH, HX8357_NORON);
}

unsigned int debug_last_percentage;
void screen_brightness(uint8_t percentage) {
  // set the light level
  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;
  TIM_OC_InitTypeDef sConfigOC;
  TIM_HandleTypeDef htim2;

  debug_last_percentage = percentage;

  memset(&htim2, 0, sizeof(htim2));
  htim2.Instance = TIM2;
  htim2.Init.Prescaler = 0;
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim2.Init.Period = 250000;
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_Base_Init(&htim2);

  memset(&sClockSourceConfig, 0, sizeof(sClockSourceConfig));
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig);

  HAL_TIM_PWM_Init(&htim2);

  /*
  memset(&sMasterConfig, 0, sizeof(sMasterConfig));
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig);
  */

  memset(&sConfigOC, 0, sizeof(sConfigOC));
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 250000/100*percentage;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_ENABLE;
  HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1);

  // start the timer
  HAL_TIM_Base_Start(&htim2);
  // start the pwm channel
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);

  PRINTF("freq:%d duty:%d\n", htim2.Init.Period, sConfigOC.Pulse);
}

// to draw font faster as the pixel loop is at the lower layer (if not directly within transport)
#define MAX_BITMAP_COLORS 16
unsigned char colors565_4bits[MAX_BITMAP_COLORS*2];
void bagl_hal_draw_bitmap_within_rect(unsigned short x, unsigned short y, unsigned short width, unsigned short height, unsigned int color_count, unsigned int *colors, unsigned int bit_per_pixel, unsigned char* bitmap, unsigned int bitmap_length_bits) {
  unsigned int i;  
  unsigned int pixel_mask = (1<<bit_per_pixel)-1;

  // TODO take care of bitmap with bit per pixel > 8 !!

  // compute  565 colors for the 4 first colors (subject to overflow here :p, but avoid too much parameters in this function)

  // RGB 888 to RGB 565
  for (i = 0; i< color_count && i < MAX_BITMAP_COLORS; i++) {
    colors565_4bits[i*2] = ((colors[i]>>16)&0xF8) | ((colors[i]>>(8+5))&0x07);
    colors565_4bits[i*2+1] = ((colors[i]>>5)&0xE0) | ((colors[i]>>3)&0x1F);  
  }

  // horizontal scan
  screen_set_xy(x, y, x+width-1, y+height-1);
  lcd_data(FLAG_COMMAND, HX8357_WRITE_MEMORY_START);


  while(bitmap_length_bits) {
    // horizontal scan
    unsigned int ch = *bitmap++;
    // draw each pixel (at most 256 index color bitmap support)
    for (i = 0; i < 8 && bitmap_length_bits; bitmap_length_bits -= bit_per_pixel, i += bit_per_pixel) {

      // grab LSB to MSB bits
      // compute the pixel color bit values to match the color in the color index
      unsigned int pixel_color_index = ((ch>>i) & pixel_mask);

      // write color index values corresponding to the given pixel color index value
      lcd_data(FLAG_PARAM, colors565_4bits[pixel_color_index*2]);
      lcd_data(FLAG_PARAM, colors565_4bits[pixel_color_index*2+1]);
    }
  }
}

void bagl_hal_draw_bitmap_continue(unsigned int bit_per_pixel, unsigned char* bitmap, unsigned int bitmap_length_bits) {
  unsigned int pixel_mask = (1<<bit_per_pixel)-1;

  while(bitmap_length_bits) {
    // horizontal scan
    unsigned int ch = *bitmap++;
    // draw each pixel (at most 256 index color bitmap support)
    unsigned int i;
    for (i = 0; i < 8 && bitmap_length_bits; bitmap_length_bits -= bit_per_pixel, i += bit_per_pixel) {

      // compute the pixel color bit values to match the color in the color index
      unsigned int pixel_color_index = ((ch>>i) & pixel_mask);

      // write color index values corresponding to the given pixel color index value
      lcd_data(FLAG_PARAM, colors565_4bits[pixel_color_index*2]);
      lcd_data(FLAG_PARAM, colors565_4bits[pixel_color_index*2+1]);
    }
  }  
}

// draw a simple rect
void bagl_hal_draw_rect(unsigned int color, unsigned short x, unsigned short y, unsigned short width, unsigned short height) {
  unsigned int i;

  // RGB 888 to RGB 565
  unsigned int color11 = ((color>>16)&0xF8) | ((color>>(8+5))&0x07);
  unsigned int color12 = ((color>>5)&0xE0) | ((color>>3)&0x1F);

  screen_set_xy(x, y, x+width-1, y+height-1);
  lcd_data(FLAG_COMMAND, HX8357_WRITE_MEMORY_START);

  i = width*height;
  while(i--) {
    lcd_data(FLAG_PARAM, color11);
    lcd_data(FLAG_PARAM, color12);
  }
}

/*-------------
refresh the screen, need to be called by application every time the screen's content changes
this method is screen dependent, as it depends on the technology and transport.
--------------*/
void screen_update(void)
{
  /*
  // useless as all chars are redrawn // bagl_hal_draw_rect(0xF9F9F9, 0, SCREEN_HEIGHT- PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT);
  bagl_draw_string(PRINTF_FONT_ID, 
                 0x000000,
                 0xF9F9F9,
                 0, SCREEN_HEIGHT-PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT,
                 screen_charbuffer, PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT,
                 BAGL_ENCODING_LATIN1);
  */
}


void screen_printc(const char ch) {

  if (newline_requested) {
    newline_requested=0;
    current_x=0;
    // rotate n-1 line
    memmove(screen_charbuffer, ((char*)screen_charbuffer)+PRINTF_LINE_CHAR_LENGTH, PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT-PRINTF_LINE_CHAR_LENGTH);
    // erase last line
    memset(((char*)screen_charbuffer)+PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT-PRINTF_LINE_CHAR_LENGTH,' ', PRINTF_LINE_CHAR_LENGTH);

    //bagl_hal_draw_rect(0xF9F9F9, 0, SCREEN_HEIGHT- PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT);
    // redraw the whole zone (all chars are printed, no problem with)
    /*
    bagl_draw_string(PRINTF_FONT_ID, 
                   0x000000,
                   0xF9F9F9,
                   0, SCREEN_HEIGHT-PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT,
                   screen_charbuffer, PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT,
                   BAGL_ENCODING_LATIN1);
    */
  }

  if(ch==0xA){
    // don't move screen yet, upon next print yes
    newline_requested = 1;

    // refresh surface
    // useless // bagl_hal_draw_rect(0xF9F9F9, 0, SCREEN_HEIGHT- PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT);
    bagl_draw_string(PRINTF_FONT_ID, 
                   0x000000,
                   0xF9F9F9,
                   0, SCREEN_HEIGHT-PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT,
                   screen_charbuffer, PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT,
                   BAGL_ENCODING_LATIN1);
  }
  else if(ch=='\r') {
    // erase last line (but don't move text around)
    memset(((char*)screen_charbuffer)+PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT-PRINTF_LINE_CHAR_LENGTH,' ', PRINTF_LINE_CHAR_LENGTH);
  }
  else if (ch >= 0x20 && ch <= 0x7F) {
    // always write at the bottom of the screen
    screen_charbuffer[PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT-PRINTF_LINE_CHAR_LENGTH+current_x] = ch;
    current_x++;
    if (current_x >= PRINTF_LINE_CHAR_LENGTH-1) {
      newline_requested = 1;
    }
  }

